---
kind: method
id: M:Autodesk.Revit.DB.Macros.MacroManagerIterator.GetCurrent
source: html/37c4ffd8-0c6b-b861-8c07-921e7463a834.htm
---
# Autodesk.Revit.DB.Macros.MacroManagerIterator.GetCurrent Method

Returns the current Macro module.

## Syntax (C#)
```csharp
public MacroModule GetCurrent()
```

## Returns
The current Macro module.

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - There is no current item in the iterator.